
<!DOCTYPE HTML>
<html lang="zh-hans" >
    <head>
        <meta charset="UTF-8">
        <meta content="text/html; charset=utf-8" http-equiv="Content-Type">
        <title>任务管理 · book for xbook2</title>
        <meta http-equiv="X-UA-Compatible" content="IE=edge" />
        <meta name="description" content="">
        <meta name="generator" content="GitBook 3.2.3">
        <meta name="author" content="jason hu">
        
        
    
    <link rel="stylesheet" href="../../gitbook/style.css">

    
            
                
                <link rel="stylesheet" href="../../gitbook/gitbook-plugin-tbfed-pagefooter/footer.css">
                
            
                
                <link rel="stylesheet" href="../../gitbook/gitbook-plugin-highlight/website.css">
                
            
                
                <link rel="stylesheet" href="../../gitbook/gitbook-plugin-search/search.css">
                
            
                
                <link rel="stylesheet" href="../../gitbook/gitbook-plugin-fontsettings/website.css">
                
            
        

    

    
        
    
        
    
        
    
        
    
        
    
        
    

        
    
    
    <meta name="HandheldFriendly" content="true"/>
    <meta name="viewport" content="width=device-width, initial-scale=1, user-scalable=no">
    <meta name="apple-mobile-web-app-capable" content="yes">
    <meta name="apple-mobile-web-app-status-bar-style" content="black">
    <link rel="apple-touch-icon-precomposed" sizes="152x152" href="../../gitbook/images/apple-touch-icon-precomposed-152.png">
    <link rel="shortcut icon" href="../../gitbook/images/favicon.ico" type="image/x-icon">

    
    
    <link rel="prev" href="../base/base.html" />
    

    </head>
    <body>
        
<div class="book">
    <div class="book-summary">
        
            
<div id="book-search-input" role="search">
    <input type="text" placeholder="输入并搜索" />
</div>

            
                <nav role="navigation">
                


<ul class="summary">
    
    
    
        
        <li>
            <a href="https://book-os.org" target="_blank" class="custom-link">bookos</a>
        </li>
    
    

    
    <li class="divider"></li>
    

    
        
        
    
        <li class="chapter " data-level="1.1" >
            
                <span>
            
                    
                    简介
            
                </span>
            

            
            <ul class="articles">
                
    
        <li class="chapter " data-level="1.1.1" data-path="../../">
            
                <a href="../../">
            
                    
                    xbook2 简介
            
                </a>
            

            
        </li>
    

            </ul>
            
        </li>
    
        <li class="chapter " data-level="1.2" >
            
                <span>
            
                    
                    快速上手
            
                </span>
            

            
            <ul class="articles">
                
    
        <li class="chapter " data-level="1.2.1" data-path="../../tutorial/quick-start.html">
            
                <a href="../../tutorial/quick-start.html">
            
                    
                    Qemu x86
            
                </a>
            

            
        </li>
    

            </ul>
            
        </li>
    
        <li class="chapter " data-level="1.3" >
            
                <span>
            
                    
                    内核
            
                </span>
            

            
            <ul class="articles">
                
    
        <li class="chapter " data-level="1.3.1" data-path="../base/base.html">
            
                <a href="../base/base.html">
            
                    
                    内核基础
            
                </a>
            

            
        </li>
    
        <li class="chapter active" data-level="1.3.2" data-path="task.html">
            
                <a href="task.html">
            
                    
                    任务管理
            
                </a>
            

            
        </li>
    

            </ul>
            
        </li>
    

    

    <li class="divider"></li>

    <li>
        <a href="https://www.gitbook.com" target="blank" class="gitbook-link">
            本书使用 GitBook 发布
        </a>
    </li>
</ul>


                </nav>
            
        
    </div>

    <div class="book-body">
        
            <div class="body-inner">
                
                    

<div class="book-header" role="navigation">
    

    <!-- Title -->
    <h1>
        <i class="fa fa-circle-o-notch fa-spin"></i>
        <a href="../.." >任务管理</a>
    </h1>
</div>




                    <div class="page-wrapper" tabindex="-1" role="main">
                        <div class="page-inner">
                            
<div id="book-search-results">
    <div class="search-noresults">
    
                                <section class="normal markdown-section">
                                
                                <h1 id="&#x4EFB;&#x52A1;&#x7BA1;&#x7406;">&#x4EFB;&#x52A1;&#x7BA1;&#x7406;</h1>
<p>&#x5728;xbook2&#x4E2D;&#xFF0C;&#x4EFB;&#x52A1;&#x662F;&#x6700;&#x5C0F;&#x7684;&#x8C03;&#x5EA6;&#x5355;&#x5143;&#xFF0C;&#x5B83;&#x53EF;&#x4EE5;&#x662F;&#x4E00;&#x4E2A;&#x5185;&#x6838;&#x7EBF;&#x7A0B;&#xFF0C;&#x4E5F;&#x53EF;&#x4EE5;&#x662F;&#x4E00;&#x4E2A;&#x8FDB;&#x7A0B;&#xFF0C;&#x751A;&#x81F3;&#x662F;&#x4E00;&#x4E2A;&#x7528;&#x6237;&#x6001;&#x7EBF;&#x7A0B;&#xFF0C;&#x8FD9;&#x53D6;&#x51B3;&#x4E8E;&#x5B83;&#x4F7F;&#x7528;&#x7684;&#x8D44;&#x6E90;&#x7684;&#x60C5;&#x51B5;&#x3002;</p>
<p>xbook2&#x76EE;&#x524D;&#x4EC5;&#x4EC5;&#x652F;&#x6301;&#x5355;&#x5904;&#x7406;&#x5668;&#xFF0C;&#x90A3;&#x4E48;&#x591A;&#x4EFB;&#x52A1;&#x7684;&#x5B9E;&#x73B0;&#x5C31;&#x662F;&#x5728;&#x4E00;&#x4E2A;&#x5904;&#x7406;&#x5668;&#x4E0A;&#x9762;&#xFF0C;&#x5FEB;&#x901F;&#x7684;&#x5207;&#x6362;&#x5F53;&#x524D;&#x6267;&#x884C;&#x6D41;&#xFF0C;&#x4ECE;&#x800C;&#x5B9E;&#x73B0;&#x591A;&#x4E2A;&#x4EFB;&#x52A1;&#x201C;&#x540C;&#x65F6;&#x201D;&#x8FD0;&#x884C;&#x7684;&#x73B0;&#x8C61;&#x3002;</p>
<h2 id="&#x591A;&#x4EFB;&#x52A1;&#x7684;&#x5DE5;&#x4F5C;&#x673A;&#x5236;">&#x591A;&#x4EFB;&#x52A1;&#x7684;&#x5DE5;&#x4F5C;&#x673A;&#x5236;</h2>
<h3 id="&#x4EFB;&#x52A1;&#x7ED3;&#x6784;&#x4F53;">&#x4EFB;&#x52A1;&#x7ED3;&#x6784;&#x4F53;</h3>
<p>&#x6BCF;&#x4E2A;&#x4EFB;&#x52A1;&#x90FD;&#x6709;&#x4E00;&#x4E2A;&#x4EFB;&#x52A1;&#x7ED3;&#x6784;&#x4F53;&#xFF0C;&#x7ED3;&#x6784;&#x4F53;&#x5305;&#x542B;&#x4E86;&#x6700;&#x57FA;&#x7840;&#x7684;&#x4FE1;&#x606F;&#xFF0C;&#x6BD4;&#x5982;&#x72B6;&#x6001;&#x3001;pid&#x3001;name&#x3001;&#x4F18;&#x5148;&#x7EA7;&#x7B49;&#xFF0C;&#x4E5F;&#x6709;&#x4EFB;&#x52A1;&#x94FE;&#x8868;&#xFF0C;&#x4EE5;&#x53CA;&#x5176;&#x5B83;&#x6210;&#x5458;&#xFF0C;&#x8BE6;&#x7EC6;&#x5B9A;&#x4E49;&#x5982;&#x4E0B;&#xFF1A;</p>
<pre><code>
typedef struct {
    unsigned char *kstack;              /* kernel stack, must be first member */
    task_state_t state;
    spinlock_t lock;                    /* &#x64CD;&#x4F5C;task&#x6210;&#x5458;&#x65F6;&#x9700;&#x8981;&#x8FDB;&#x884C;&#x4E0A;&#x9501; */
    cpuid_t cpuid;
    pid_t pid;                          /* process id */
    pid_t parent_pid;
    pid_t tgid;                         /* &#x7EBF;&#x7A0B;&#x7EC4;id&#xFF1A;&#x7EBF;&#x7A0B;&#x5C5E;&#x4E8E;&#x54EA;&#x4E2A;&#x8FDB;&#x7A0B;&#xFF0C;&#x548C;pid&#x4E00;&#x6837;&#xFF0C;&#x5C31;&#x8BF4;&#x660E;&#x662F;&#x4E3B;&#x7EBF;&#x7A0B;&#xFF0C;&#x4E0D;&#x7136;&#x5C31;&#x662F;&#x5B50;&#x7EBF;&#x7A0B; */
    pid_t pgid;                         /* &#x8FDB;&#x7A0B;&#x7EC4;ID&#xFF1A;&#x7528;&#x4E8E;&#x7EC8;&#x7AEF;&#x63A7;&#x5236; */
    unsigned long flags;                
    char priority;             /* &#x4EFB;&#x52A1;&#x7684;&#x52A8;&#x6001;&#x4F18;&#x5148;&#x7EA7; */
    char static_priority;      /* &#x4EFB;&#x52A1;&#x7684;&#x9759;&#x6001;&#x4F18;&#x5148;&#x7EA7; */
    unsigned long ticks;                /* &#x8FD0;&#x884C;&#x7684;ticks&#xFF0C;&#x5F53;&#x524D;&#x5269;&#x4F59;&#x7684;timeslice */
    unsigned long timeslice;            /* &#x65F6;&#x95F4;&#x7247;&#xFF0C;&#x53EF;&#x4EE5;&#x52A8;&#x6001;&#x8C03;&#x6574; */
    unsigned long elapsed_ticks;        /* &#x4EFB;&#x52A1;&#x6267;&#x884C;&#x603B;&#x5171;&#x5360;&#x7528;&#x7684;&#x65F6;&#x95F4;&#x7247;&#x6570; */
    unsigned long syscall_ticks;        /* &#x6267;&#x884C;&#x7CFB;&#x7EDF;&#x8C03;&#x7528;&#x603B;&#x5171;&#x5360;&#x7528;&#x7684;&#x65F6;&#x95F4;&#x7247;&#x6570; */
    clock_t syscall_ticks_delta;  /* &#x6267;&#x884C;&#x5355;&#x4E2A;&#x7CFB;&#x7EDF;&#x8C03;&#x7528;&#x5360;&#x7528;&#x7684;&#x65F6;&#x95F4;&#x7247;&#x6570; */
    int exit_status;                    
    char name[MAX_TASK_NAMELEN];        
    struct vmm *vmm;                    
    list_t list;                        /* &#x5904;&#x4E8E;&#x6240;&#x5728;&#x961F;&#x5217;&#x7684;&#x94FE;&#x8868;&#xFF0C;&#x5C31;&#x7EEA;&#x961F;&#x5217;&#xFF0C;&#x963B;&#x585E;&#x961F;&#x5217;&#x7B49; */
    list_t global_list;                 /* &#x5168;&#x5C40;&#x4EFB;&#x52A1;&#x961F;&#x5217;&#xFF0C;&#x7528;&#x6765;&#x67E5;&#x627E;&#x6240;&#x6709;&#x5B58;&#x5728;&#x7684;&#x4EFB;&#x52A1; */
    exception_manager_t exception_manager;         
    timer_t sleep_timer;               
    fpu_t fpu;
    alarm_t alarm;                      
    long errcode;                       /* &#x9519;&#x8BEF;&#x7801;&#xFF1A;&#x7528;&#x6237;&#x591A;&#x7EBF;&#x7A0B;&#x65F6;&#x7528;&#x6765;&#x6807;&#x8BB0;&#x6BCF;&#x4E00;&#x4E2A;&#x7EBF;&#x7A0B;&#x7684;&#x9519;&#x8BEF;&#x7801; */
    pthread_desc_t *pthread;            /* &#x7528;&#x6237;&#x7EBF;&#x7A0B;&#x7BA1;&#x7406;&#xFF0C;&#x591A;&#x4E2A;&#x7EBF;&#x7A0B;&#x5171;&#x540C;&#x5360;&#x6709;&#xFF0C;&#x53EA;&#x6709;&#x4E00;&#x4E2A;&#x4E3B;&#x7EBF;&#x7A0B;&#x7684;&#x65F6;&#x5019;&#x4E3A;NULL */
    file_man_t *fileman;    
    exit_hook_t exit_hook;  /* &#x9000;&#x51FA;&#x8C03;&#x7528;&#x7684;&#x94A9;&#x5B50;&#x51FD;&#x6570; */
    void *exit_hook_arg;
    lpc_port_table_t port_table;
    port_comm_t *port_comm;
    struct tms times;
    unsigned int stack_magic;
} task_t;
</code></pre><h3 id="&#x4EFB;&#x52A1;&#x7684;&#x91CD;&#x8981;&#x5C5E;&#x6027;">&#x4EFB;&#x52A1;&#x7684;&#x91CD;&#x8981;&#x5C5E;&#x6027;</h3>
<h4 id="&#x5185;&#x6838;&#x6808;">&#x5185;&#x6838;&#x6808;</h4>
<p>&#x76EE;&#x524D;&#x4EFB;&#x52A1;&#x7684;&#x5185;&#x6838;&#x6808;&#x548C;&#x4EFB;&#x52A1;&#x7528;&#x540C;&#x4E00;&#x4E2A;&#x5185;&#x5B58;&#x5730;&#x5740;&#x3002;&#x4E5F;&#x5C31;&#x662F;&#x5206;&#x914D;&#x4EFB;&#x52A1;&#x7684;&#x65F6;&#x5019;&#xFF0C;&#x4F1A;&#x5206;&#x914D;<code>TASK_KERN_STACK_SIZE</code>&#x5927;&#x5C0F;&#x7ED9;task&#xFF0C;&#x7136;&#x540E;&#x5185;&#x6838;&#x6808;&#x6808;&#x9876;&#x5C31;&#x5728;<code>kstack + TASK_KERN_STACK_SIZE</code>&#x8FD9;&#x4E2A;&#x4F4D;&#x7F6E;&#x3002;</p>
<h4 id="&#x4EFB;&#x52A1;&#x72B6;&#x6001;">&#x4EFB;&#x52A1;&#x72B6;&#x6001;</h4>
<p>&#x4EFB;&#x52A1;&#x72B6;&#x6001;&#x7528;&#x6765;&#x63CF;&#x8FF0;&#x4EFB;&#x52A1;&#x76EE;&#x524D;&#x5904;&#x4E8E;&#x54EA;&#x79CD;&#x72B6;&#x6001;&#xFF0C;&#x5728;&#x4E0D;&#x540C;&#x72B6;&#x6001;&#x4E0B;&#x9762;&#xFF0C;&#x4EFB;&#x52A1;&#x6709;&#x4E0D;&#x540C;&#x7684;&#x884C;&#x4E3A;&#x3002;&#x4EFB;&#x52A1;&#x6709;&#x5C31;&#x7EEA;&#x3001;&#x6267;&#x884C;&#x4E2D;&#x3001;&#x963B;&#x585E;&#x3001;&#x7B49;&#x5F85;&#x3001;&#x505C;&#x6B62;&#x3001;&#x6302;&#x8D77;&#x3001;&#x50F5;&#x5C38;&#x8FD9;7&#x79CD;&#x72B6;&#x6001;&#x3002;&#x5177;&#x4F53;&#x63CF;&#x8FF0;&#x5982;&#x4E0B;&#xFF1A;</p>
<table>
<thead>
<tr>
<th style="text-align:center">&#x72B6;&#x6001;</th>
<th style="text-align:center">&#x63CF;&#x8FF0;</th>
</tr>
</thead>
<tbody>
<tr>
<td style="text-align:center">&#x5C31;&#x7EEA;&#x72B6;&#x6001;&#xFF08;TASK_READY&#xFF09;</td>
<td style="text-align:center">&#x5F53;&#x4EFB;&#x52A1;&#x88AB;&#x521B;&#x5EFA;&#x540E;&#xFF0C;&#x5C31;&#x4F1A;&#x662F;&#x5C31;&#x7EEA;&#x72B6;&#x6001;&#xFF0C;&#x7136;&#x540E;&#x4F1A;&#x88AB;&#x6DFB;&#x52A0;&#x5230;&#x5C31;&#x7EEA;&#x961F;&#x5217;&#x4E0A;&#x9762;&#xFF0C;&#x7B49;&#x5F85;&#x88AB;&#x8C03;&#x5EA6;&#x3002;&#x53EA;&#x8981;&#x60F3;&#x8981;&#x88AB;&#x6267;&#x884C;&#xFF0C;&#x5C31;&#x5F97;&#x5148;&#x5904;&#x4E8E;&#x5C31;&#x7EEA;&#x72B6;&#x6001;&#xFF0C;&#x624D;&#x6709;&#x673A;&#x4F1A;&#x5F97;&#x5230;&#x6267;&#x884C;&#x3002;</td>
</tr>
<tr>
<td style="text-align:center">&#x8FD0;&#x884C;&#x72B6;&#x6001;&#xFF08;TASK_RUNNING&#xFF09;</td>
<td style="text-align:center">&#x5F53;&#x524D;&#x4EFB;&#x52A1;&#x6B63;&#x5728;&#x8FD0;&#x884C;&#xFF0C;&#x5904;&#x7406;&#x5668;&#x6B63;&#x5728;&#x6267;&#x884C;&#x672C;&#x4EFB;&#x52A1;</td>
</tr>
<tr>
<td style="text-align:center">&#x963B;&#x585E;&#x72B6;&#x6001;&#xFF08;TASK_BLOCKED&#xFF09;</td>
<td style="text-align:center">&#x5F53;&#x56E0;&#x4E3A;IO&#x6216;&#x8005;&#x5176;&#x5B83;&#x539F;&#x56E0;&#x4E0D;&#x80FD;&#x8FD0;&#x884C;&#x65F6;&#xFF0C;&#x5C31;&#x5904;&#x4E8E;&#x963B;&#x585E;&#x72B6;&#x6001;&#xFF0C;&#x9700;&#x8981;&#x89E3;&#x9664;&#x963B;&#x585E;&#xFF0C;&#x624D;&#x80FD;&#x7EE7;&#x7EED;&#x8FD0;&#x884C;&#x3002;</td>
</tr>
<tr>
<td style="text-align:center">&#x7B49;&#x5F85;&#x72B6;&#x6001;&#xFF08;TASK_WAITING&#xFF09;</td>
<td style="text-align:center">&#x672C;&#x72B6;&#x6001;&#x662F;&#x4EFB;&#x52A1;&#x5904;&#x4E8E;&#x7B49;&#x5F85;&#x65F6;&#x7684;&#x72B6;&#x6001;&#xFF0C;&#x6BD4;&#x5982;&#x7B49;&#x5F85;&#x5B50;&#x8FDB;&#x7A0B;&#x65F6;&#xFF0C;&#x5C31;&#x662F;&#x4F4D;&#x4E8E;&#x8FD9;&#x4E2A;&#x72B6;&#x6001;&#xFF0C;&#x9700;&#x8981;&#x5B50;&#x8FDB;&#x7A0B;&#x63A8;&#x51FA;&#x65F6;&#x88AB;&#x5524;&#x9192;&#x3002;</td>
</tr>
<tr>
<td style="text-align:center">&#x505C;&#x6B62;&#x72B6;&#x6001;&#xFF08;TASK_STOP&#xFF09;</td>
<td style="text-align:center">&#x4EFB;&#x52A1;&#x56E0;&#x4E3A;&#x67D0;&#x79CD;&#x539F;&#x56E0;&#x505C;&#x6B62;&#x8FD0;&#x884C;&#xFF0C;&#x548C;&#x6682;&#x505C;&#x4E00;&#x4E2A;&#x610F;&#x601D;&#xFF0C;&#x4E0D;&#x662F;IO&#x5BFC;&#x81F4;&#x505C;&#x6B62;&#x7684;</td>
</tr>
<tr>
<td style="text-align:center">&#x6302;&#x8D77;&#x72B6;&#x6001;&#xFF08;TASK_HANGING&#xFF09;</td>
<td style="text-align:center">&#x5F53;&#x8FDB;&#x7A0B;&#x9000;&#x51FA;&#x540E;&#xFF0C;&#x9700;&#x8981;&#x7B49;&#x5F85;&#x7236;&#x8FDB;&#x7A0B;&#x6765;&#x56DE;&#x6536;&#x8FDB;&#x7A0B;&#x5269;&#x4F59;&#x7684;&#x8D44;&#x6E90;&#xFF0C;&#x5C31;&#x5904;&#x4E8E;&#x8FD9;&#x4E2A;&#x72B6;&#x6001;</td>
</tr>
<tr>
<td style="text-align:center">&#x50F5;&#x5C38;&#x72B6;&#x6001;&#xFF08;TASK_ZOMBIE&#xFF09;</td>
<td style="text-align:center">&#x8FDB;&#x7A0B;&#x9000;&#x51FA;&#x7684;&#x65F6;&#x5019;&#xFF0C;&#x7236;&#x8FDB;&#x7A0B;&#x6CA1;&#x6709;&#x7B49;&#x5F85;&#x5B83;&#xFF0C;&#x5C31;&#x5904;&#x4E8E;&#x50F5;&#x5C38;&#x72B6;&#x6001;</td>
</tr>
</tbody>
</table>
<h4 id="&#x4EFB;&#x52A1;&#x7684;&#x4F18;&#x5148;&#x7EA7;">&#x4EFB;&#x52A1;&#x7684;&#x4F18;&#x5148;&#x7EA7;</h4>
<p>xbook2 &#x91C7;&#x53D6;&#x4E86;&#x52A8;&#x6001;&#x4F18;&#x5148;&#x7EA7;&#x7684;&#x7B97;&#x6CD5;&#xFF0C;&#x4F18;&#x5148;&#x7EA7;&#x4E0D;&#x662F;&#x6839;&#x636E;&#x4F18;&#x5148;&#x7EA7;&#x6570;&#x91CF;&#x6765;&#x8BBE;&#x7F6E;&#x7684;&#xFF0C;&#x800C;&#x5B9E;&#x6839;&#x636E;&#x4F18;&#x5148;&#x7EA7;&#x7B49;&#x7EA7;&#xFF0C;&#x800C;&#x4F18;&#x5148;&#x7EA7;&#x7B49;&#x7EA7;&#x5219;&#x662F;&#x6839;&#x636E;&#x4EFB;&#x52A1;&#x7684;&#x7C7B;&#x578B;&#x6765;&#x8BBE;&#x5B9A;&#x7684;&#x3002;</p>
<p>&#x5173;&#x4E8E;&#x4F18;&#x5148;&#x7EA7;&#x7684;&#x63CF;&#x8FF0;&#x5982;&#x4E0B;&#xFF1A;</p>
<table>
<thead>
<tr>
<th style="text-align:center">&#x4F18;&#x5148;&#x7EA7;</th>
<th style="text-align:center">&#x63CF;&#x8FF0;</th>
</tr>
</thead>
<tbody>
<tr>
<td style="text-align:center">&#x4F4E;&#xFF08;TASK_PRIO_LEVEL_LOW&#xFF09;</td>
<td style="text-align:center">&#x6700;&#x4F4E;&#x7684;&#x4F18;&#x5148;&#x7EA7;&#xFF0C;&#x5F53;&#x6CA1;&#x6709;&#x8DDF;&#x9AD8;&#x7684;&#x4F18;&#x5148;&#x7EA7;&#x4EFB;&#x52A1;&#x65F6;&#xFF0C;&#x624D;&#x4F1A;&#x8FD0;&#x884C;&#x8FD9;&#x91CC;&#x9762;&#x7684;&#x4EFB;&#x52A1;&#xFF0C;&#x4E00;&#x822C;&#x90FD;&#x662F;idle&#x4EFB;&#x52A1;</td>
</tr>
<tr>
<td style="text-align:center">&#x666E;&#x901A;&#xFF08;TASK_PRIO_LEVEL_NORMAL&#xFF09;</td>
<td style="text-align:center">&#x8FD9;&#x4E2A;&#x4F18;&#x5148;&#x7EA7;&#x662F;&#x5927;&#x591A;&#x6570;&#x4EFB;&#x52A1;&#x4F4D;&#x4E8E;&#x7684;&#x4F18;&#x5148;&#x7EA7;&#xFF0C;&#x7528;&#x6237;&#x6001;&#x4EFB;&#x52A1;&#x90FD;&#x662F;&#x8FD9;&#x4E2A;&#x4F18;&#x5148;&#x7EA7;</td>
</tr>
<tr>
<td style="text-align:center">&#x9AD8;&#xFF08;TASK_PRIO_LEVEL_HIGH&#xFF09;</td>
<td style="text-align:center">&#x9AD8;&#x4F18;&#x5148;&#x7EA7;&#xFF0C;&#x662F;NORMAL&#x4F18;&#x5148;&#x7EA7;&#x7684;&#x4EFB;&#x52A1;&#x56E0;&#x4E3A;&#x67D0;&#x4E9B;&#x60C5;&#x51B5;&#xFF0C;&#x9700;&#x8981;&#x7D27;&#x6025;&#x8FD0;&#x884C;&#xFF0C;&#x5C31;&#x4F1A;&#x8FDB;&#x5165;&#x5230;&#x9AD8;&#x4F18;&#x5148;&#x7EA7;&#xFF0C;&#x6267;&#x884C;&#x5B8C;&#x540E;&#xFF0C;&#x4F1A;&#x52A8;&#x6001;&#x7684;&#x964D;&#x4F4E;&#x5230;NORMAL&#x4F18;&#x5148;&#x7EA7;</td>
</tr>
<tr>
<td style="text-align:center">&#x5B9E;&#x65F6;&#xFF08;TASK_PRIO_LEVEL_REALTIME&#xFF09;</td>
<td style="text-align:center">&#x5B9E;&#x65F6;&#x4F18;&#x5148;&#x7EA7;&#x662F;&#x6700;&#x9AD8;&#x4F18;&#x5148;&#x7EA7;&#xFF0C;&#x8FD9;&#x4E2A;&#x4F18;&#x5148;&#x7EA7;&#x7684;&#x4EFB;&#x52A1;&#x4F1A;&#x6700;&#x5148;&#x8FD0;&#x884C;&#xFF0C;&#x4F46;&#x662F;&#x6CE8;&#x610F;&#xFF0C;&#x8FD9;&#x4E2A;&#x4F18;&#x5148;&#x7EA7;&#x7684;&#x4EFB;&#x52A1;&#x5FC5;&#x987B;&#x662F;IO&#x963B;&#x585E;&#x7684;&#xFF0C;&#x8FD0;&#x884C;&#x4E00;&#x4F1A;&#x513F;&#x540E;&#x5C31;&#x9700;&#x8981;&#x963B;&#x585E;&#xFF0C;&#x4E0D;&#x80FD;&#x6B7B;&#x5FAA;&#x73AF;&#x3002;</td>
</tr>
</tbody>
</table>
<h4 id="&#x65F6;&#x95F4;&#x7247;">&#x65F6;&#x95F4;&#x7247;</h4>
<p>&#x65F6;&#x95F4;&#x7247;&#x662F;&#x6839;&#x636E;ticks&#x6765;&#x8BA1;&#x7B97;&#x7684;&#xFF0C;&#x6BCF;&#x4E2A;&#x4EFB;&#x52A1;&#x4F1A;&#x8FD0;&#x884C;&#x67D0;&#x4E2A;&#x56FA;&#x5B9A;&#x7684;&#x65F6;&#x95F4;&#x7247;&#x540E;&#xFF0C;&#x5C31;&#x4F1A;&#x5207;&#x6362;&#x5230;&#x5176;&#x5B83;&#x4EFB;&#x52A1;&#x3002;&#x65F6;&#x95F4;&#x7247;&#x8D8A;&#x5927;&#xFF0C;&#x6267;&#x884C;&#x7684;&#x65F6;&#x95F4;&#x8D8A;&#x4E45;&#xFF0C;&#x53CD;&#x4E4B;&#x8D8A;&#x77ED;&#x3002;</p>
<h3 id="&#x4EFB;&#x52A1;&#x72B6;&#x6001;&#x5207;&#x6362;">&#x4EFB;&#x52A1;&#x72B6;&#x6001;&#x5207;&#x6362;</h3>
<p>&#x4EFB;&#x52A1;&#x521B;&#x5EFA;&#x540E;&#xFF0C;&#x4F1A;&#x5904;&#x4E8E;&#x5C31;&#x7EEA;(READY)&#x72B6;&#x6001;&#xFF0C;&#x518D;&#x6DFB;&#x52A0;&#x5230;&#x8C03;&#x5EA6;&#x961F;&#x5217;&#x540E;&#xFF0C;&#x5C31;&#x53EF;&#x4EE5;&#x88AB;&#x8C03;&#x5EA6;&#x5668;&#x8C03;&#x5EA6;&#x4E86;&#x3002;&#x5F53;&#x88AB;&#x8C03;&#x5EA6;&#x540E;&#xFF0C;&#x5C31;&#x662F;&#x5904;&#x4E8E;&#x6267;&#x884C;(RUNNING)&#x72B6;&#x6001;&#x3002;&#x5728;&#x6267;&#x884C;&#x8FC7;&#x7A0B;&#x4E2D;&#xFF0C;&#x5982;&#x679C;&#x88AB;&#x65F6;&#x949F;&#x4E2D;&#x65AD;&#x4E86;&#xFF0C;&#x5C31;&#x4F1A;&#x53BB;&#x8C03;&#x7528;&#x8C03;&#x5EA6;&#x5668;&#xFF0C;&#x7136;&#x540E;&#x5207;&#x6362;&#x5230;&#x4E0B;&#x4E00;&#x4E2A;&#x4EFB;&#x52A1;&#xFF0C;&#x672C;&#x4EFB;&#x52A1;&#x5904;&#x4E8E;&#x5C31;&#x7EEA;&#x72B6;&#x6001;&#xFF0C;&#x6DFB;&#x52A0;&#x5230;&#x5C31;&#x7EEA;&#x961F;&#x5217;&#x4E2D;&#x3002;&#x4E0B;&#x4E00;&#x4E2A;&#x4EFB;&#x52A1;&#x5C31;&#x5904;&#x4E8E;&#x8FD0;&#x884C;&#x4E2D;&#x3002;</p>
<p>&#x5728;&#x6267;&#x884C;&#x8FC7;&#x7A0B;&#x4E2D;&#xFF0C;&#x5982;&#x679C;&#x8C03;&#x7528;&#x4E86;&#x963B;&#x585E;&#x5F0F;&#x7684;IO&#x8BBE;&#x5907;&#xFF0C;&#x5219;&#x9700;&#x8981;&#x963B;&#x585E;&#x7B49;&#x5F85;&#x8BBE;&#x5907;&#x5B8C;&#x6210;&#x6570;&#x636E;&#x4EA4;&#x4E92;&#xFF0C;&#x6B64;&#x65F6;&#x5904;&#x4E8E;&#x963B;&#x585E;&#xFF08;BLOCKED&#xFF09;&#x72B6;&#x6001;&#xFF0C;&#x5B8C;&#x6210;&#x540E;&#xFF0C;&#x88AB;&#x5524;&#x9192;&#xFF0C;&#x5904;&#x4E8E;&#x5C31;&#x7EEA;&#x72B6;&#x6001;&#x3002;</p>
<p>&#x5F53;&#x8FDB;&#x7A0B;&#x8C03;&#x7528;waitpid&#x65F6;&#xFF0C;&#x5C31;&#x4F1A;&#x7B49;&#x5F85;&#x5B50;&#x8FDB;&#x7A0B;&#x5B8C;&#x6210;&#xFF0C;&#x6B64;&#x65F6;&#x5904;&#x4E8E;&#x7B49;&#x5F85;&#xFF08;WAITING&#xFF09;&#x72B6;&#x6001;&#xFF0C;&#x5F53;&#x5B50;&#x8FDB;&#x7A0B;&#x9000;&#x51FA;&#x540E;&#xFF0C;&#x5C31;&#x4F1A;&#x5524;&#x9192;&#x81EA;&#x5DF1;&#xFF0C;&#x53C8;&#x53D8;&#x6210;&#x5C31;&#x7EEA;&#x72B6;&#x6001;&#x3002;</p>
<p>&#x5F53;&#x56E0;&#x4E3A;&#x67D0;&#x79CD;&#x539F;&#x56E0;&#xFF0C;&#x6BD4;&#x5982;&#x88AB;&#x8981;&#x6C42;&#x6682;&#x505C;&#x8FD0;&#x884C;&#x65F6;&#xFF0C;&#x5219;&#x5904;&#x4E8E;&#x505C;&#x6B62;&#xFF08;STOP&#xFF09;&#x72B6;&#x6001;&#xFF0C;&#x7136;&#x540E;&#x7B49;&#x5F85;&#x88AB;&#x5524;&#x9192;&#x7EE7;&#x7EED;&#x8FD0;&#x884C;&#xFF0C;&#x53C8;&#x53D8;&#x6210;&#x5C31;&#x7EEA;&#x72B6;&#x6001;&#x3002;</p>
<p>&#x5F53;&#x5B50;&#x8FDB;&#x7A0B;&#x9000;&#x51FA;&#x65F6;&#xFF0C;&#x5C31;&#x4F1A;&#x53D8;&#x6210;&#x6302;&#x8D77;&#xFF08;HANGING&#xFF09;&#x72B6;&#x6001;&#xFF0C;&#x7B49;&#x5F85;&#x7236;&#x8FDB;&#x7A0B;&#x56DE;&#x6536;&#x8D44;&#x6E90;&#x3002;&#x8D44;&#x6E90;&#x56DE;&#x6536;&#x540E;&#xFF0C;&#x5B50;&#x8FDB;&#x7A0B;&#x5219;&#x4F1A;&#x88AB;&#x91CA;&#x653E;&#xFF0C;&#x4ECE;&#x6B64;&#x6D88;&#x5931;&#x3002;</p>
<p>&#x8FD8;&#x6709;&#x4E00;&#x79CD;&#x72B6;&#x6001;&#x5C31;&#x662F;&#xFF0C;&#x5B50;&#x8FDB;&#x7A0B;&#x9000;&#x51FA;&#x65F6;&#xFF0C;&#x53D1;&#x73B0;&#x6CA1;&#x6709;&#x7236;&#x8FDB;&#x7A0B;&#x7B49;&#x5F85;&#x81EA;&#x5DF1;&#xFF0C;&#x90A3;&#x4E48;&#x4F1A;&#x53D8;&#x6210;&#x50F5;&#x5C38;&#xFF08;ZOMBIE&#xFF09;&#x72B6;&#x6001;&#x3002;</p>
<h3 id="&#x7CFB;&#x7EDF;&#x7EBF;&#x7A0B;">&#x7CFB;&#x7EDF;&#x7EBF;&#x7A0B;</h3>
<p>&#x5728;&#x7CFB;&#x7EDF;&#x8FD0;&#x884C;&#x7684;&#x8FC7;&#x7A0B;&#x4E2D;&#xFF0C;&#x4F1A;&#x6709;&#x4E00;&#x4E9B;&#x5B88;&#x62A4;&#x7EBF;&#x7A0B;&#xFF0C;&#x4F8B;&#x5982;idle&#x4EFB;&#x52A1;&#xFF0C;&#x5C31;&#x662F;&#x4E3A;&#x4E86;&#x4FDD;&#x8BC1;&#x81F3;&#x5C11;&#x4F1A;&#x6709;&#x4E00;&#x4E2A;&#x4EFB;&#x52A1;&#x8FD0;&#x884C;&#x3002;&#x4E0D;&#x7136;&#x7684;&#x82B1;&#xFF0C;&#x5904;&#x7406;&#x5668;&#x6CA1;&#x4EFB;&#x52A1;&#x8C03;&#x5EA6;&#xFF0C;&#x5C31;&#x4F1A;&#x6B7B;&#x673A;&#x4E86;&#x3002;&#x5728;&#x76EE;&#x524D;&#x7684;&#x5185;&#x6838;&#x4E2D;&#xFF0C;&#x521D;&#x59CB;&#x6267;&#x884C;&#x6D41;&#xFF0C;&#x4E5F;&#x5C31;&#x662F;boot&#x5F00;&#x59CB;&#x6267;&#x884C;&#x7684;&#x8FD9;&#x4E2A;&#x6267;&#x884C;&#x6D41;&#x4F1A;&#x5728;&#x6700;&#x540E;&#x6F14;&#x53D8;&#x6210;idle&#x7EBF;&#x7A0B;&#x3002;</p>
<h2 id="&#x4EFB;&#x52A1;&#x7684;&#x7BA1;&#x7406;&#x65B9;&#x5F0F;">&#x4EFB;&#x52A1;&#x7684;&#x7BA1;&#x7406;&#x65B9;&#x5F0F;</h2>
<p>&#x4EFB;&#x52A1;&#x7684;&#x57FA;&#x7840;&#x64CD;&#x4F5C;&#x5305;&#x62EC;&#xFF1A;&#x521B;&#x5EFA;/&#x9000;&#x51FA;&#x3001;&#x963B;&#x585E;/&#x89E3;&#x9664;&#x963B;&#x585E;&#x3001;&#x8BA9;&#x51FA;&#xFF08;yield&#xFF09;</p>
<h3 id="&#x521B;&#x5EFA;&#x548C;&#x9000;&#x51FA;&#x4EFB;&#x52A1;">&#x521B;&#x5EFA;&#x548C;&#x9000;&#x51FA;&#x4EFB;&#x52A1;</h3>
<p>&#x521B;&#x5EFA;&#x4E00;&#x4E2A;&#x4EFB;&#x52A1;&#xFF1A;</p>
<pre><code class="lang-c"><span class="hljs-keyword">task_t</span> *task_create(<span class="hljs-keyword">char</span> *name, <span class="hljs-keyword">uint8_t</span> prio_level, <span class="hljs-keyword">task_func_t</span> *func, <span class="hljs-keyword">void</span> *arg);
</code></pre>
<p>&#x5F53;&#x8C03;&#x7528;&#x8BE5;&#x51FD;&#x6570;&#x540E;&#xFF0C;&#x5C31;&#x4F1A;&#x521B;&#x5EFA;&#x4E00;&#x4E2A;&#x4EFB;&#x52A1;&#xFF0C;&#x5982;&#x679C;&#x6210;&#x529F;&#x5219;&#x8FD4;&#x56DE;&#x4EFB;&#x52A1;&#x7684;&#x6307;&#x9488;&#xFF0C;&#x5931;&#x8D25;&#x8FD4;&#x56DE;NULL&#xFF0C;&#x53EF;&#x4EE5;&#x7ED9;&#x4EFB;&#x52A1;&#x6307;&#x5B9A;name&#xFF0C;&#x5E76;&#x4F20;&#x5165;&#x4E00;&#x4E2A;&#x4F18;&#x5148;&#x7EA7;&#xFF0C;&#x63A5;&#x7740;&#x5C31;&#x662F;&#x4EFB;&#x52A1;&#x7684;&#x6267;&#x884C;&#x51FD;&#x6570;&#x548C;&#x53C2;&#x6570;&#x4E86;&#x3002;&#x4EFB;&#x52A1;&#x7684;&#x51FD;&#x6570;&#x7ED3;&#x6784;&#x5982;&#x4E0B;&#xFF1A;</p>
<pre><code class="lang-c"><span class="hljs-function"><span class="hljs-keyword">void</span> <span class="hljs-title">task_demo</span><span class="hljs-params">(<span class="hljs-keyword">void</span> *arg)</span>
</span>{
    ...
}
<span class="hljs-keyword">task_t</span> *task = task_create(<span class="hljs-string">&quot;demo&quot;</span>, TASK_PRIO_LEVEL_NORMAL, task_demo, <span class="hljs-string">&quot;hello, demo&quot;</span>);
</code></pre>
<p>&#x4EFB;&#x52A1;&#x9000;&#x51FA;&#x6267;&#x884C;&#xFF1A;</p>
<pre><code class="lang-c"><span class="hljs-function"><span class="hljs-keyword">void</span> <span class="hljs-title">task_exit</span><span class="hljs-params">(<span class="hljs-keyword">int</span> status)</span></span>;
</code></pre>
<p>&#x5F53;&#x5185;&#x6838;&#x7EBF;&#x7A0B;&#x8C03;&#x7528;&#x8BE5;&#x51FD;&#x6570;&#x540E;&#xFF0C;&#x5C31;&#x4F1A;&#x9000;&#x51FA;&#x6267;&#x884C;&#xFF0C;&#x5E76;&#x4F20;&#x5165;&#x9000;&#x51FA;&#x72B6;&#x6001;&#x3002;</p>
<h3 id="&#x963B;&#x585E;&#x548C;&#x89E3;&#x9664;&#x963B;&#x585E;&#x4EFB;&#x52A1;">&#x963B;&#x585E;&#x548C;&#x89E3;&#x9664;&#x963B;&#x585E;&#x4EFB;&#x52A1;</h3>
<p>&#x963B;&#x585E;&#x4EFB;&#x52A1;&#xFF1A;</p>
<pre><code class="lang-c"><span class="hljs-function"><span class="hljs-keyword">void</span> <span class="hljs-title">task_block</span><span class="hljs-params">(task_state_t state)</span></span>;
</code></pre>
<p>&#x5F53;&#x8C03;&#x7528;&#x8BE5;&#x51FD;&#x6570;&#x65F6;&#xFF0C;&#x9700;&#x8981;&#x4F20;&#x5165;&#x4E00;&#x4E2A;&#x963B;&#x585E;&#x7684;&#x72B6;&#x6001;&#xFF0C;&#x53EF;&#x9009;&#x72B6;&#x6001;&#x6709;TASK_BLOCKED&#x3001;TASK_WAITING&#x3001;TASK_STOPPED&#x3001;TASK_HANGING&#x3001;TASK_ZOMBIE&#x3002;&#x56E0;&#x4E3A;&#x8FD9;&#x4E9B;&#x72B6;&#x6001;&#x90FD;&#x662F;&#x963B;&#x585E;&#x540E;&#xFF0C;&#x4E0D;&#x80FD;&#x7EE7;&#x7EED;&#x5F80;&#x4E0B;&#x9762;&#x8FD0;&#x884C;&#xFF0C;&#x9700;&#x8981;&#x5524;&#x9192;&#x6216;&#x8005;&#x4E0D;&#x518D;&#x8FD0;&#x884C;&#x3002;</p>
<p>&#x5982;&#x679C;&#x662F;TASK_BLOCKED&#x3001;TASK_WAITING&#x3001;TASK_STOPPED&#x5219;&#x53EF;&#x4EE5;&#x88AB;&#x5524;&#x9192;&#xFF0C;&#x518D;&#x6B21;&#x53D8;&#x6210;READY&#x72B6;&#x6001;&#x6267;&#x884C;&#x3002;</p>
<p>&#x89E3;&#x9664;&#x4EFB;&#x52A1;&#x7684;&#x963B;&#x585E;&#xFF1A;</p>
<pre><code class="lang-c"><span class="hljs-function"><span class="hljs-keyword">void</span> <span class="hljs-title">task_unblock</span><span class="hljs-params">(task_t *task)</span></span>;
</code></pre>
<p>&#x8C03;&#x7528;&#x8BE5;&#x51FD;&#x6570;&#x65F6;&#xFF0C;&#x6307;&#x5B9A;&#x89E3;&#x9664;&#x67D0;&#x4E2A;&#x4EFB;&#x52A1;&#x7684;&#x963B;&#x585E;&#xFF0C;&#x4EFB;&#x52A1;&#x7684;&#x72B6;&#x6001;&#x5FC5;&#x987B;&#x662F;&#x4F4D;&#x4E8E;TASK_BLOCKED&#x3001;TASK_WAITING&#x3001;TASK_STOPPED&#x8FD9;&#x4E9B;&#x72B6;&#x6001;&#x624D;&#x884C;&#x3002;&#x89E3;&#x9664;&#x963B;&#x585E;&#x540E;&#xFF0C;&#x5C31;&#x6062;&#x590D;&#x5230;&#x4E4B;&#x524D;&#x7684;&#x72B6;&#x6001;&#x4E86;&#x3002;</p>
<h3 id="&#x8BA9;&#x51FA;&#x5904;&#x7406;&#x5668;&#xFF1A;">&#x8BA9;&#x51FA;&#x5904;&#x7406;&#x5668;&#xFF1A;</h3>
<p>&#x5F53;&#x4EFB;&#x52A1;&#x73B0;&#x5728;&#x4E0D;&#x50CF;&#x56E0;&#x4E3A;&#x7A7A;&#x5FAA;&#x73AF;&#x800C;&#x5F71;&#x54CD;&#x6574;&#x4F53;&#x6027;&#x80FD;&#xFF0C;&#x5C31;&#x53EF;&#x4EE5;&#x901A;&#x8FC7;&#x8BA9;&#x51FA;&#x64CD;&#x4F5C;&#xFF0C;&#x4E0D;&#x7B49;&#x65F6;&#x95F4;&#x7247;&#x6267;&#x884C;&#x5B8C;&#x5C31;&#x53EF;&#x4EE5;&#x8C03;&#x5EA6;&#x4E0B;&#x4E00;&#x4E2A;&#x4EFB;&#x52A1;&#xFF1A;</p>
<pre><code class="lang-c"><span class="hljs-function"><span class="hljs-keyword">void</span> <span class="hljs-title">task_yield</span><span class="hljs-params">()</span></span>;
</code></pre>
<h3 id="&#x521B;&#x5EFA;&#x8FDB;&#x7A0B;">&#x521B;&#x5EFA;&#x8FDB;&#x7A0B;</h3>
<p>&#x5F53;&#x9700;&#x8981;&#x521B;&#x5EFA;&#x4E00;&#x4E2A;&#x8FDB;&#x7A0B;&#x65F6;&#xFF0C;&#x5C31;&#x9700;&#x8981;&#x8C03;&#x7528;&#x53E6;&#x5916;&#x7684;&#x51FD;&#x6570;&#xFF0C;&#x4E13;&#x95E8;&#x7528;&#x6765;&#x521B;&#x5EFA;&#x8FDB;&#x7A0B;&#x7684;&#x3002;</p>
<pre><code class="lang-c"><span class="hljs-keyword">task_t</span> *process_create(<span class="hljs-keyword">char</span> **argv, <span class="hljs-keyword">char</span> **envp, <span class="hljs-keyword">uint32_t</span> flags);
</code></pre>
<p>&#x9700;&#x8981;&#x4F20;&#x9012;&#x53C2;&#x6570;argv&#x548C;&#x73AF;&#x5883;&#x53D8;&#x91CF;envp&#xFF0C;argv[0]&#x4FDD;&#x5B58;&#x7740;&#x53EF;&#x6267;&#x884C;&#x7A0B;&#x5E8F;&#x7684;&#x8DEF;&#x5F84;&#x3002;</p>
<p>&#x6BD4;&#x5982;&#x8FD9;&#x91CC;&#x521B;&#x5EFA;init&#x8FDB;&#x7A0B;&#x65F6;&#xFF0C;&#x5C31;&#x4F20;&#x5165;&#x4E86;init&#x8FDB;&#x7A0B;&#x7684;&#x8DEF;&#x5F84;&#x53C2;&#x6570;&#xFF0C;&#x4ECE;&#x800C;&#x5B9E;&#x73B0;&#x4ECE;&#x6587;&#x4EF6;&#x7CFB;&#x7EDF;&#x52A0;&#x8F7D;&#x7A0B;&#x5E8F;&#x6267;&#x884C;&#x3002;&#x521B;&#x5EFA;&#x6210;&#x529F;&#x5219;&#x8FD4;&#x56DE;&#x521B;&#x5EFA;&#x7684;&#x4EFB;&#x52A1;&#xFF0C;&#x5931;&#x8D25;&#x5219;&#x8FD4;&#x56DE;NULL&#x3002;</p>
<p><img src="figures/proc.png" alt="proc"></p>
<h3 id="&#x5176;&#x5B83;&#x64CD;&#x4F5C;&#x63A5;&#x53E3;">&#x5176;&#x5B83;&#x64CD;&#x4F5C;&#x63A5;&#x53E3;</h3>
<pre><code class="lang-c"><span class="hljs-comment">/* &#x590D;&#x5236;&#x4E00;&#x4E2A;&#x5B50;&#x8FDB;&#x7A0B;&#xFF0C;&#x548C;&#x81EA;&#x5DF1;&#x4E00;&#x6837; */</span>
<span class="hljs-function"><span class="hljs-keyword">int</span> <span class="hljs-title">sys_fork</span><span class="hljs-params">()</span></span>;
<span class="hljs-comment">/* &#x7B49;&#x5F85;pid&#x9000;&#x51FA;&#xFF0C;status&#x4FDD;&#x5B58;&#x72B6;&#x6001;&#xFF0C;options&#x4F20;&#x5165;&#x4E00;&#x4E9B;&#x9009;&#x9879; */</span>
<span class="hljs-keyword">pid_t</span> sys_waitpid(<span class="hljs-keyword">pid_t</span> pid, <span class="hljs-keyword">int</span> *status, <span class="hljs-keyword">int</span> options);
<span class="hljs-comment">/* &#x66FF;&#x6362;&#x5F53;&#x524D;&#x7684;&#x6267;&#x884C;&#x955C;&#x50CF;&#x4E3A;pathname&#x7684;&#x53EF;&#x6267;&#x884C;&#x6587;&#x4EF6;&#x5185;&#x5BB9; */</span>
<span class="hljs-function"><span class="hljs-keyword">int</span> <span class="hljs-title">sys_execve</span><span class="hljs-params">(<span class="hljs-keyword">const</span> <span class="hljs-keyword">char</span> *pathname, <span class="hljs-keyword">const</span> <span class="hljs-keyword">char</span> *argv[], <span class="hljs-keyword">const</span> <span class="hljs-keyword">char</span> *envp[])</span></span>;
<span class="hljs-comment">/* &#x8FDB;&#x7A0B;&#x9000;&#x51FA;&#x6267;&#x884C; */</span>
<span class="hljs-function"><span class="hljs-keyword">void</span> <span class="hljs-title">sys_exit</span><span class="hljs-params">(<span class="hljs-keyword">int</span> status)</span></span>;
<span class="hljs-comment">/* &#x4F11;&#x7720; */</span>
<span class="hljs-function"><span class="hljs-keyword">unsigned</span> <span class="hljs-keyword">long</span> <span class="hljs-title">sys_sleep</span><span class="hljs-params">(<span class="hljs-keyword">unsigned</span> <span class="hljs-keyword">long</span> second)</span></span>;
<span class="hljs-comment">/* &#x521B;&#x5EFA;&#x4E00;&#x4E2A;&#x8FDB;&#x7A0B;&#xFF0C;&#x521B;&#x5EFA;&#x5B8C;&#x540E;&#x7236;&#x8FDB;&#x7A0B;&#x8FD4;&#x56DE;&#xFF0C;flags&#x4E3A;PROC_CREATE_STOP&#x65F6;&#xFF0C;&#x521B;&#x5EFA;&#x540E;&#x4E0D;&#x7ACB;&#x5373;&#x6267;&#x884C; */</span>
<span class="hljs-function"><span class="hljs-keyword">int</span> <span class="hljs-title">sys_create_process</span><span class="hljs-params">(<span class="hljs-keyword">char</span> **argv, <span class="hljs-keyword">char</span> **envp, uint32_t flags)</span></span>;
<span class="hljs-comment">/* &#x5F53;&#x521B;&#x5EFA;&#x7684;&#x8FDB;&#x7A0B;&#x662F;&#x5904;&#x4E8E;STOP&#x72B6;&#x6001;&#x65F6;&#xFF0C;&#x53EF;&#x4EE5;&#x901A;&#x8FC7;resume&#x8BA9;&#x5B83;&#x6267;&#x884C; */</span>
<span class="hljs-function"><span class="hljs-keyword">int</span> <span class="hljs-title">sys_resume_process</span><span class="hljs-params">(pid_t pid)</span></span>;
</code></pre>
<h2 id="&#x66F4;&#x591A;&#x4EFB;&#x52A1;&#x76F8;&#x5173;&#x5185;&#x5BB9;&#xFF0C;&#x8BF7;&#x67E5;&#x770B;&#x6E90;&#x7801;&#xFF01;">&#x66F4;&#x591A;&#x4EFB;&#x52A1;&#x76F8;&#x5173;&#x5185;&#x5BB9;&#xFF0C;&#x8BF7;&#x67E5;&#x770B;&#x6E90;&#x7801;&#xFF01;</h2>
<footer class="page-footer"><span class="copyright">Copyright &#xA9; BookOS-developers 2021 all right reserved&#xFF0C;powered by Gitbook</span><span class="footer-modification">&#x4FEE;&#x8BA2;&#x65F6;&#x95F4;&#xFF1A;
2021-06-10
</span></footer>
                                
                                </section>
                            
    </div>
    <div class="search-results">
        <div class="has-results">
            
            <h1 class="search-results-title"><span class='search-results-count'></span> results matching "<span class='search-query'></span>"</h1>
            <ul class="search-results-list"></ul>
            
        </div>
        <div class="no-results">
            
            <h1 class="search-results-title">No results matching "<span class='search-query'></span>"</h1>
            
        </div>
    </div>
</div>

                        </div>
                    </div>
                
            </div>

            
                
                <a href="../base/base.html" class="navigation navigation-prev navigation-unique" aria-label="Previous page: 内核基础">
                    <i class="fa fa-angle-left"></i>
                </a>
                
                
            
        
    </div>

    <script>
        var gitbook = gitbook || [];
        gitbook.push(function() {
            gitbook.page.hasChanged({"page":{"title":"任务管理","level":"1.3.2","depth":2,"previous":{"title":"内核基础","level":"1.3.1","depth":2,"path":"programing-manual/base/base.md","ref":"programing-manual/base/base.md","articles":[]},"dir":"ltr"},"config":{"plugins":["tbfed-pagefooter"],"styles":{"website":"styles/website.css","pdf":"styles/pdf.css","epub":"styles/epub.css","mobi":"styles/mobi.css","ebook":"styles/ebook.css","print":"styles/print.css"},"pluginsConfig":{"tbfed-pagefooter":{"copyright":"Copyright &copy BookOS-developers 2021","modify_label":"修订时间：","modify_format":"YYYY-MM-DD"},"highlight":{},"search":{},"lunr":{"maxIndexSize":1000000,"ignoreSpecialCharacters":false},"sharing":{"facebook":true,"twitter":true,"google":false,"weibo":false,"instapaper":false,"vk":false,"all":["facebook","google","twitter","weibo","instapaper"]},"fontsettings":{"theme":"white","family":"sans","size":2},"theme-default":{"styles":{"website":"styles/website.css","pdf":"styles/pdf.css","epub":"styles/epub.css","mobi":"styles/mobi.css","ebook":"styles/ebook.css","print":"styles/print.css"},"showLevel":false}},"theme":"default","author":"jason hu","pdf":{"pageNumbers":true,"fontSize":12,"fontFamily":"Arial","paperSize":"a4","chapterMark":"pagebreak","pageBreaksBefore":"/","margin":{"right":62,"left":62,"top":56,"bottom":56}},"structure":{"langs":"LANGS.md","readme":"README.md","glossary":"GLOSSARY.md","summary":"SUMMARY.md"},"variables":{},"title":"book for xbook2","language":"zh-hans","links":{"sidebar":{"bookos":"https://book-os.org"}},"gitbook":"3.2.3","description":"document for xbook2 kernel"},"file":{"path":"programing-manual/task/task.md","mtime":"2021-06-10T15:11:25.257Z","type":"markdown"},"gitbook":{"version":"3.2.3","time":"2021-06-10T16:06:38.729Z"},"basePath":"../..","book":{"language":""}});
        });
    </script>
</div>

        
    <script src="../../gitbook/gitbook.js"></script>
    <script src="../../gitbook/theme.js"></script>
    
        
        <script src="../../gitbook/gitbook-plugin-search/search-engine.js"></script>
        
    
        
        <script src="../../gitbook/gitbook-plugin-search/search.js"></script>
        
    
        
        <script src="../../gitbook/gitbook-plugin-lunr/lunr.min.js"></script>
        
    
        
        <script src="../../gitbook/gitbook-plugin-lunr/search-lunr.js"></script>
        
    
        
        <script src="../../gitbook/gitbook-plugin-sharing/buttons.js"></script>
        
    
        
        <script src="../../gitbook/gitbook-plugin-fontsettings/fontsettings.js"></script>
        
    

    </body>
</html>

